[M_Orchid_PlotMission03 MissionDefinition]
MissionName="Crimson Study Room"
MissionDescription="According to Shadow, in order to find the treasure lost in the sand, you must find a woman named Scarlett. He has a red cap and a scarf [place]water water[-place]. Use an elegant style."
TurnInDescription="This is Captain Scarlet, who has wealth, courage and loves to kill people without weapons.."
MissionSummary="Find Captain Scarlet.."
MissionGiver="I'm sorry."
MissionTurnInLocation="Captain Scarlett"
TeaserText=""

[M_Orchid_PlotMission03:DestroyBanditHovercrafts MissionObjectiveSetDefinition]
MissionSummaryOverride="Destroy the Sandman's ship."
MissionDescriptionOverride="According to Shade, if you want to find the lost treasure, you must find a woman named Captain Scarlet Stop when you arrive at Scarlet Castle. [place]water pump[-place], He found himself and his men in the midst of Sandman's expansion. like a city [place]oasis[-place]. Scarlett calls you personally and demands that you pay Sandman's son right after you meet him and discuss the treasure.."

[M_Orchid_PlotMission03:DestroyHovercrafts MissionObjectiveDefinition]
ProgressMessage="Destroy the attacking stones"

[M_Orchid_PlotMission03:FindPirateQueen MissionObjectiveDefinition]
ProgressMessage="In search of the Pirate Queen's ship"

[M_Orchid_PlotMission03:FindPirateQueenBase MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission03:GetHovercraft MissionObjectiveDefinition]
ProgressMessage="Find a boat"

[M_Orchid_PlotMission03:MeetPirateQueen MissionObjectiveDefinition]
ProgressMessage="Meet Captain Scully!"

[M_Orchid_PlotMission03:MeetPirateQueenSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission03:ObtainHovercraft MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

